---
kind: method
id: M:Autodesk.Revit.DB.Toposolid.GetSlabShapeEditor
source: html/4b7c441c-9f4f-4756-14bc-5fc387043c3e.htm
---
# Autodesk.Revit.DB.Toposolid.GetSlabShapeEditor Method

Gets a SlabShapeEditor that can be used to add or modify points of this Toposolid.

## Syntax (C#)
```csharp
public SlabShapeEditor GetSlabShapeEditor()
```

## Returns
The SlabShapeEditor object